tutorials/Aerodynamics/Rotor67/run/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.5e-03;

boundaryField
{
    bladeps
    {
        type            fixedValue;
        value           uniform 0;
    }
    bladess
    {
        type            fixedValue;
        value           uniform 0;
    }
    bladefillet
    {
        type            fixedValue;
        value           uniform 0;
    }
    hub
    {
        type            fixedValue;
        value           uniform 0;
    }
    shroud
    {
        type            fixedValue;
        value           uniform 0;
    }
    per1
    {
        type            cyclic;
    }
    per2
    {
        type            cyclic;
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
