tutorials/Aerodynamics/Rotor67/run/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (-0.5 -0.5 -0.5)
    (0.5 -0.5 -0.5)
    (0.5 0.5 -0.5)
    (-0.5 0.5 -0.5)
    (-0.5 -0.5 0.5)
    (0.5 -0.5 0.5)
    (0.5 0.5 0.5)
    (-0.5 0.5 0.5)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1.0 1.0 1.0)
);

edges
(
);

boundary
(
    topSurface
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    bottomSurface
    {
        type patch;
        faces
        (
            (4 0 1 5)
        );
    }

    fixedEnd
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    tractionEnd
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
